<?php

define('CONFIRM_TOKEN', '');
define('TOKEN', '');
define('SECRET_KEY', '');
define('API_VERSION', '5.82');
define('API_URL', 'https://api.vk.com/method/');

$data = json_decode(file_get_contents('php://input'));

/**
 * Валидация секретного ключа
 *
 */
if (strcmp($data->secret, SECRET_KEY) !== 0 && strcmp($data->type, 'confirmation') !== 0) {
    return;
}

/**
 * Поведение, в зависимости
 * от типа запроса
 *
 */
switch ($data->type) {
    case 'confirmation':
        confirmation();
        break;

    case 'message_new':
        message($data);
        break;

    case 'group_join':
        joinGroup($data);
        break;

    case 'group_leave':
        leaveGroup($data);
        break;
}

/**
 * Подтверждения токена
 *
 */
function confirmation()
{
    echo CONFIRM_TOKEN;
}

/**
 * Ответ на новое сообщение
 *
 * @param object $data
 */
function message($data)
{
    $user = getUser($data);
    $body = $data->object->body;
    $message = getMessage($body);

    request($user, $message);
}

/**
 * Ответ на присоединение к группе
 *
 * @param object $data
 */
function joinGroup($data)
{
    $user = getUser($data);
    $message = $user["name"] . ", рады приветствовать Вас в нашей группе! 😄
        В двух словах о том, чем мы занимаемся:
        БилетАвто - это сервис продажи билетов на автобусы.
        Ниже представлены ответы на наиболее часто задаваемые вопросы.
        Пожалуйста, выберите команду по интересующей Вас теме и вышлите в ответ нужную цифру:
        1 – Вас интересует расписание?
        2 – Стоимость проезда
        3 – Телефон автостанции
        4 – Хотите забронировать билет
        5 – Покупка билета
        6 – Что делать, если по выбранному билету нет данных о расписании
        7 – Возврат билета
        8 – Замена билета
        9 – Проблемы технического характера, прочие вопросы!";

    request($user, $message);
}

/**
 * Ответ на выход из группы
 *
 * @param object $data
 */
function leaveGroup($data)
{
    $user = getUser($data);
    $message = $user["name"] . ", нам очень жаль прощаться с Вами 😔 
        Мы всегда будем ждать Вас в нашей уютной компании.
        Если возникли вопросы - ниже ответы на наиболее часто задаваемые.
        Пожалуйста, выберите команду по интересующей Вас теме и вышлите в ответ нужную цифру:
        1 – Вас интересует расписание?
        2 – Стоимость проезда
        3 – Телефон автостанции
        4 – Хотите забронировать билет
        5 – Покупка билета
        6 – Что делать, если по выбранному билету нет данных о расписании
        7 – Возврат билета
        8 – Замена билета
        9 – Проблемы технического характера, прочие вопросы!";

    request($user, $message);
}

/**
 * Получение информации о пользователе
 *
 * @param object $data
 *
 * @return array $user
 */
function getUser($data)
{
    $id = $data->object->user_id;
    $info = json_decode(file_get_contents(API_URL . "users.get?user_ids={$id}&v=" . API_VERSION . '&access_token=' . TOKEN));
    $name = $info->response[0]->first_name;

    $user = [
        'id' => $id,
        'name' => $name
    ];

    return $user;
}

/**
 * Передача данных в VK-API
 *
 * @param array $user
 * @param string $message
 *
 * @return string
 */
function request($user, $message)
{
    $params = array(
        'message' => "{$message}",
        'user_id' => $user['id'],
        'access_token' => TOKEN,
        'v' => API_VERSION
    );

    $params = http_build_query($params);
    file_get_contents(API_URL . 'messages.send?' . $params);
    echo('ok');
}

/**
 * Ответы на команды в диалоге
 *
 * @param integer $param
 *
 * @return string $message
 */
function getMessage($param)
{
    switch ($param) {
        case 1:
            $message = 'Расписание движения автобусов можно посмотреть на сайте в разделе https://search.biletavto.ru/. 
            Нужно указать пункт отправления автобуса и пункт прибытия, а также желаемую дату отправления. После этого 
            отобразится расписание автобусов по данному маршруту с указанием времени отправления, времени следования в 
            пути, а также стоимости билета.';
            break;

        case 2:
            $message = 'Для того, чтобы узнать стоимость проезда автобусов необходимо в разделе https://search.biletavto.ru/ 
            указать пункт отправления автобуса и пункт прибытия, а также желаемую дату отправления. После этого отобразится 
            стоимость билета, а также расписание автобусов по данному маршруту с указанием времени отправления и времени 
            следования в пути.';
            break;

        case 3:
            $message = 'Телефоны автовокзалов доступны по ссылке: https://biletavto.ru/telefony-avtovokzalov/. 
            В строке поиска введите нужный город';
            break;

        case 4:
            $message = 'К сожалению, забронировать билет на сайте невозможно, можно лишь приобрести его самостоятельно, 
            нажав на желтую кнопку "Купить".';
            break;

        case 5:
            $message = 'Подробная инструкции покупки билета доступна по ссылке https://biletavto.ru/faq#f0';
            break;

        case 6:
            $message = 'К сожалению данный рейс к нашей системе не подключен, вы можете уточнить необходимую информацию, 
            позвонив на автовокзал. Телефон вы можете посмотреть по ссылке: https://biletavto.ru/telefony-avtovokzalov/. 
            В строке поиска введите нужный город';
            break;

        case 7:
            $message = 'Для того, чтобы вернуть билет и получить его стоимость обратно необходимо в личном кабинете зайти 
            в "Мои заказы". Далее. выбрав оплаченный рейс, нажать на кнопку "Возврат билета". Заполнив необходимые поля 
            (номер вашей карты), нажать на кнопку "Отправить". Тем самым, автоматически сформируется заявление на возврат. 
            Сумма возврата зависит от условий Перевозчика, а также от времени, которое осталось до поездки. 
            Чем раньше Вы оформили возврат, тем большую сумму вернете. Билет можно вернуть только до отправления автобуса, 
            после отправления автобуса билет возврату не подлежит. Подробнее тут: https://biletavto.ru/faq#f7';
            break;

        case 8:
            $message = 'К сожалению, обменять билет (на другую дату или время/место) на сайте невозможно, можно лишь 
            оформить возврат и приобрести новый. Для того, чтобы оформить возврат билета необходимо в личном кабинете 
            зайти в "Мои заказы". Далее. выбрав оплаченный рейс, нажать на кнопку "Возврат билета".';
            break;

        case 9:
            $message = 'Если у вас проблема с оплатой, не пришёл эл. билет на почту либо другая техническая ошибка – 
            обратитесь на почту тех. поддержки сайта info@biletavto.ru';
            break;
        
        default:
            $message = "Я — бот БилетАвто. Спасибо, что написали
            Пожалуйста, выберите команду по интересующей Вас теме и вышлите в ответ нужную цифру:
            1 – Вас интересует расписание?
            2 – Стоимость проезда
            3 – Телефон автостанции
            4 – Хотите забронировать билет
            5 – Покупка билета
            6 – Что делать, если по выбранному билету нет данных о расписании
            7 – Возврат билета
            8 - Замена билета
            9 – Проблемы технического характера, прочие вопросы";
            break;
    }

    return $message;
}
